<a href="https://colab.research.google.com/github/Ziad-Fahmy/Data-Mining/blob/main/pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import numpy as np
import pandas as pd

#creating a Series

In [ ]:
label = ['a','b','c']
my_list = [10,20,30]
arr = np.array([10,20,30])
d = {'a':10,'b':20,'c':30}

In [ ]:
label

['a', 'b', 'c']

In [ ]:
my_list

[10, 20, 30]

In [ ]:
arr

array([10, 20, 30])

In [ ]:
d

{'a': 10, 'b': 20, 'c': 30}

##Using Lists

In [ ]:
pd.Series(data=my_list)

0    10
1    20
2    30
dtype: int64

In [ ]:
pd.Series(data=my_list,index=label)

a    10
b    20
c    30
dtype: int64

In [ ]:
pd.Series(my_list,label)

a    10
b    20
c    30
dtype: int64

Using numpy arr

In [ ]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int64

In [ ]:
pd.Series(arr,label)

a    10
b    20
c    30
dtype: int64

Using Dictionary

In [ ]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

##Access Values

In [ ]:
my_data = [1,2,3,4]
countries = ['USA','Germany','USSR','Japan']
ser1 = pd.Series(my_data,countries)

In [ ]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [ ]:
ser2 = pd.Series([1,2,5,4],['USA','Germany','Italy','Japan'])

In [ ]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [ ]:
ser1['USA']

1

Operation

In [ ]:
ser1[1]

<ipython-input-19-71bd6e38c038>:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  ser1[1]

2